---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures.CannotCutParallelToLocationCurve
source: html/4b2b0b05-9e49-10d8-0eef-89ce9e556230.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures.CannotCutParallelToLocationCurve Property

Cut plane of slanted column end is parallel to the location curve.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCutParallelToLocationCurve { get; }
```